madubois/nrf9160-feather-examples-and-drivers/samples/cerbere_gps/src/main.c
    ((struct sockaddr_in *)res->ai_addr)->sin_port = htons(HTTP_PORT);
   

    int client_fd = socket(AF_INET, SOCK_STREAM, 0);

    LOG_INF("client_fd: %d", client_fd);
    err = bind(client_fd, (struct sockaddr *)&local_addr,sizeof(local_addr));
    LOG_INF("bind err: %d", err);


    err = blocking_connect(client_fd, (struct sockaddr *)res->ai_addr,sizeof(struct sockaddr_in));
    LOG_INF("connect err: %d", err);


/** 
	if (err >= 0) {

    LOG_INF("Prepare send buffer:");
    send_data_len = snprintf(send_buf, 2000,
                                     "POST %s HTTP/1.1\r\n"
                                     "Host: %s\r\n\r\n"
                                     JSON_TEMPLATE,
                                     HTTP_PATH, HTTP_HOST, (long)ts, lat, lng);
	
   
    do {
        num_bytes =
        blocking_send(client_fd, send_buf, send_data_len, 0);
       
        if (num_bytes < 0) {
            LOG_INF("ret: %d, errno: %s\n", num_bytes, strerror(errno));
        };
		

    } while (num_bytes < 0);

	}
*/

    LOG_INF("Finished. Closing socket");
    err = close(client_fd);

    freeaddrinfo(res);

  ret = lte_lc_func_mode_set(LTE_LC_FUNC_MODE_DEACTIVATE_LTE);


    if (ret) {
        LOG_ERR("Failed to disconnect from LTE network");
    } else {
        LOG_INF("Disconnected from LTE network");
    }

                k_sem_give(&lte_connected);

///////////////////////////////////////////////////////////////////////////////////////


                break;

        case LTE_LC_EVT_RRC_UPDATE:
				LOG_INF("xLTE_LC_EVT_RRC_UPDATE");
				break;
        case LTE_LC_EVT_CELL_UPDATE:
				LOG_INF("xLTE_LC_EVT_CELL_UPDATE");
				break;
		case LTE_LC_EVT_LTE_MODE_UPDATE:
			LOG_INF("xLTE_LC_EVT_LTE_MODE_UPDATE"); 
			break;
        case LTE_LC_EVT_MODEM_EVENT:
				LOG_INF("xLTE_LC_EVT_MODEM_EVENT");
                /* Handle LTE events that are enabled by default. */
                break;

        default:
				LOG_INF("AUTRE?");
                break;
        }

 
}




















int main(void)
{
	int err;
	uint8_t cnt = 0;
	struct nrf_modem_gnss_nmea_data_frame *nmea_data;

	LOG_INF("Starting GNSS sample");
	err = nrf_modem_lib_init();
	if (err) {
		LOG_ERR("Modem library initialization failed, error: %d", err);
		return err;
	}



	//lte_lc_system_mode_set(LTE_LC_SYSTEM_MODE_LTEM_GPS,LTE_LC_SYSTEM_MODE_PREFER_AUTO);

	/* Initialize reference coordinates (if used). */
	//if (sizeof(CONFIG_GNSS_SAMPLE_REFERENCE_LATITUDE) > 1 &&
	//    sizeof(CONFIG_GNSS_SAMPLE_REFERENCE_LONGITUDE) > 1) {
	//	ref_used = true;
	//	ref_latitude = atof(CONFIG_GNSS_SAMPLE_REFERENCE_LATITUDE);
	//	ref_longitude = atof(CONFIG_GNSS_SAMPLE_REFERENCE_LONGITUDE);
	//}

	//if (modem_init() != 0) {
	//	LOG_ERR("Failed to initialize modem");
	//	return -1;
	//}

	//if (sample_init() != 0) {
	//	LOG_ERR("Failed to initialize sample");
	//	return -1;
	//}

	//if (gnss_init_and_start() != 0) {
	//	LOG_ERR("Failed to initialize and start GNSS");
	//	return -1;
	//}

	//fix_timestamp = k_uptime_get();

	lte_lc_init();

	


	int ret;

	//ret = lte_lc_connect_async(lte_handler);
	//if (ret) {
	//		printk("lte_lc_connect_async, error: %d\n", ret);
	//		return 0;
	//}

























	ret = lte_lc_connect();
	if (ret) {
		printk("lte_lc_connect, error: %d\n", ret);
		return 0;
	}

	printk("lte_lc_connect, ret: %d\n", ret);











	struct sockaddr_in local_addr;
    struct addrinfo *res;
    int send_data_len;
    int num_bytes;
    int mtu_size = MAX_MTU_SIZE;
    //char send_buf[SEND_BUF_SIZE];
   
    local_addr.sin_family = AF_INET;
    local_addr.sin_port = htons(0);
    local_addr.sin_addr.s_addr = 0;


	struct addrinfo hints = {
		.ai_family = AF_INET,       //1
		.ai_socktype = SOCK_DGRAM,  //2
        .ai_next = NULL,
        .ai_addr = NULL,
        .ai_protocol = 0   //any protocol
	};

     err = getaddrinfo(HTTP_HOST, NULL, &hints, &res);
    LOG_INF("getaddrinfo err: %d", err);
	
    ((struct sockaddr_in *)res->ai_addr)->sin_port = htons(HTTP_PORT);
   

    int client_fd = socket(AF_INET, SOCK_STREAM, 0);

    LOG_INF("client_fd: %d", client_fd);
    err = bind(client_fd, (struct sockaddr *)&local_addr,sizeof(local_addr));
    LOG_INF("bind err: %d", err);


    err = blocking_connect(client_fd, (struct sockaddr *)res->ai_addr,sizeof(struct sockaddr_in));
    LOG_INF("connect err: %d", err);



	long ts = 0;
	float lat = 0;
	float lng = 0;



	if (err >= 0) {

    LOG_INF("Prepare send buffer:");
    send_data_len = snprintf(send_buf, 2000,
                                     "POST %s HTTP/1.1\r\n"
                                     "Host: %s\r\n\r\n"
                                     JSON_TEMPLATE,
                                     HTTP_PATH, HTTP_HOST, (long)ts, lat, lng);
	
   
    do {
        num_bytes =
        blocking_send(client_fd, send_buf, send_data_len, 0);
       
        if (num_bytes < 0) {
            LOG_INF("ret: %d, errno: %s\n", num_bytes, strerror(errno));
        };
		

    } while (num_bytes < 0);

	}

	LOG_INF("Finished. Closing socket  1");
	err = close(client_fd);

	//freeaddrinfo(res);










char response[64];
 err = nrf_modem_at_cmd(response, sizeof(response), "AT+CGPADDR");
if (err == 0) {
    printk("AT+CGPADDR response: %s\n", response);
}




	k_sleep(K_SECONDS(10));







	client_fd = socket(AF_INET, SOCK_STREAM, 0);

    LOG_INF("client_fd: %d", client_fd);
    err = bind(client_fd, (struct sockaddr *)&local_addr,sizeof(local_addr));
    LOG_INF("bind err: %d", err);


    err = blocking_connect(client_fd, (struct sockaddr *)res->ai_addr,sizeof(struct sockaddr_in));
    LOG_INF("connect err: %d", err);



	 ts = 0;
	 lat = 0;
	 lng = 0;



	if (err >= 0) {

    LOG_INF("Prepare send buffer:");
    send_data_len = snprintf(send_buf, 2000,
                                     "POST %s HTTP/1.1\r\n"
                                     "Host: %s\r\n\r\n"
                                     JSON_TEMPLATE,
                                     HTTP_PATH, HTTP_HOST, (long)ts, lat, lng);
	
   
    do {
        num_bytes =
        blocking_send(client_fd, send_buf, send_data_len, 0);
       
        if (num_bytes < 0) {
            LOG_INF("ret: %d, errno: %s\n", num_bytes, strerror(errno));
        };
		

    } while (num_bytes < 0);

