madubois/nrf9160-feather-examples-and-drivers/samples/cerbere_gps/src/main.c
	}

	LOG_INF("Finished. Closing socket   2");
	err = close(client_fd);




 err = nrf_modem_at_cmd(response, sizeof(response), "AT+CGPADDR");
if (err == 0) {
    printk("AT+CGPADDR response: %s\n", response);
}





//err = nrf_modem_at_cmd(response, sizeof(response), 'AT+CPSMS=1,,,"00101000","00000001"');


	

	int n =0;

	while (n<10) {
		k_sleep(K_SECONDS(1));
		err = nrf_modem_at_cmd(response, sizeof(response), "AT+CPSMS?");
if (err == 0) {
    printk("%d AT+CPSMS? response: %s\n",n, response);
}

n++;
	}


printk("\n\n\n\n");


	client_fd = socket(AF_INET, SOCK_STREAM, 0);

    LOG_INF("client_fd: %d", client_fd);
    err = bind(client_fd, (struct sockaddr *)&local_addr,sizeof(local_addr));
    LOG_INF("bind err: %d", err);


    err = blocking_connect(client_fd, (struct sockaddr *)res->ai_addr,sizeof(struct sockaddr_in));
    LOG_INF("connect err: %d", err);



	 ts = 0;
	 lat = 0;
	 lng = 0;



	if (err >= 0) {

    LOG_INF("Prepare send buffer:");
    send_data_len = snprintf(send_buf, 2000,
                                     "POST %s HTTP/1.1\r\n"
                                     "Host: %s\r\n\r\n"
                                     JSON_TEMPLATE,
                                     HTTP_PATH, HTTP_HOST, (long)ts, lat, lng);
	
   
    do {
        num_bytes =
        blocking_send(client_fd, send_buf, send_data_len, 0);
       
        if (num_bytes < 0) {
            LOG_INF("ret: %d, errno: %s\n", num_bytes, strerror(errno));
        };
		

    } while (num_bytes < 0);

	}

	LOG_INF("Finished. Closing socket");
	err = close(client_fd);


 err = nrf_modem_at_cmd(response, sizeof(response), "AT+CGPADDR");
if (err == 0) {
    printk("3 AT+CGPADDR response: %s\n", response);
}



		err = nrf_modem_at_cmd(response, sizeof(response), "AT+CPSMS?");
if (err == 0) {
    printk("3 AT+CPSMS? response: %s\n", response);
}




n=0;

	while (n<50) {
		k_sleep(K_SECONDS(1));
		err = nrf_modem_at_cmd(response, sizeof(response), "AT+CSCON?");
if (err == 0) {
    printk("%d AT+CSCON? response: %s\n",n, response);

	if(n==25){
		err = nrf_modem_at_cmd(response, sizeof(response), "AT+CSCON=0");
	}
}

n++;
	}






















printk("\n\n\n\n");


	client_fd = socket(AF_INET, SOCK_STREAM, 0);

    LOG_INF("client_fd: %d", client_fd);
    err = bind(client_fd, (struct sockaddr *)&local_addr,sizeof(local_addr));
    LOG_INF("bind err: %d", err);


    err = blocking_connect(client_fd, (struct sockaddr *)res->ai_addr,sizeof(struct sockaddr_in));
    LOG_INF("connect err: %d", err);



	 ts = 0;
	 lat = 0;
	 lng = 0;



	if (err >= 0) {

    LOG_INF("Prepare send buffer:");
    send_data_len = snprintf(send_buf, 2000,
                                     "POST %s HTTP/1.1\r\n"
                                     "Host: %s\r\n\r\n"
                                     JSON_TEMPLATE,
                                     HTTP_PATH, HTTP_HOST, (long)ts, lat, lng);
	
   
    do {
        num_bytes =
        blocking_send(client_fd, send_buf, send_data_len, 0);
       
        if (num_bytes < 0) {
            LOG_INF("ret: %d, errno: %s\n", num_bytes, strerror(errno));
        };
		

    } while (num_bytes < 0);

	}

	LOG_INF("Finished. Closing socket");
	err = close(client_fd);


 err = nrf_modem_at_cmd(response, sizeof(response), "AT+CGPADDR");
if (err == 0) {
    printk("4 AT+CGPADDR response: %s\n", response);
}



		err = nrf_modem_at_cmd(response, sizeof(response), "AT+CPSMS?");
if (err == 0) {
    printk("4 AT+CPSMS? response: %s\n", response);
}













	
	//k_sem_take(&lte_connected, K_FOREVER);




	k_sleep(K_SECONDS(1000));


	return 0;
}
